functionalTests/cfdemSolverPiso/couette/CFD/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    outerWall
    {
	type	fixedValue;
	value	uniform (0 0 0);
    }

    innerWall
    {
        type rotatingWallVelocity;
	origin (0 0 0);
	axis (0 0 1);
	omega constant 6.2831; //radiant per second
    }

}


// ************************************************************************* //
